import type { NextApiRequest, NextApiResponse } from 'next'
import { ownFetch } from "@/server/fetch";
import { EChapterStatus, INetChapterDetailRes } from "@/typings/chapter.interface";

// 5001 排行榜页面
export default async function handler(
  req: NextApiRequest,
  res: NextApiResponse<INetChapterDetailRes>
) {

  const { chapterInfo } ={
    "bookInfo": {
      "author": "小妖本仙",
      "bookId": "11000162501",
      "bookName": "我曾愛你，奮不顧身",
      "introduction": "結婚兩年，素手調羹，最終也比不過他心中的那個白月光。\r\n她受夠了，也煩了單向婚姻，可是卻還是被他圈在他的世界裏。\r\n“如果你不愛我，就放開我好嗎！？”\r\n“放開你？這輩子都不可能！”",
      "cover": "https://nbookimg.klynf.com/cppartner/1x1/11x0/110x0/11000162501/11000162501.jpg?t=20210728144159",
      "bannerPic": "",
      "viewCountDisplay": "10.6萬",
      "lastChapterUtime": "2018-09-30 20:29:01",
      "ratings": "9.0",
      "chapterCount": "46",
      "writeStatus": "完本",
      "viewCount": "106068"
    },
    "chapterInfo": {
      "id": "33338367",
      "chapterName": "第一章:輸血",
      "isCharge": false,
      "content": "第一章:輸血\n唐芷淇站在落地窗前，臉色看起來有些煞白，嘴角自嘲地笑了出來。\n他大概是不會回來了吧……\n正想著，門外突然傳來了車子引擎的聲音，她立刻回過神來，跑到了門口翹首以待。\n門剛打開，沒等她反應過來，手就被一隻大掌抓住，人就被拽到了客廳。\n手上傳來的溫暖，男人寬厚的背影印在唐芷淇的眸子裏，貪婪的目光深深被迷住，她瞬間滿心歡喜，“亦琛，你回來啦？我做了很多你愛吃的……”\n“別廢話，跟我走。”沈亦琛不耐煩地打斷她，“明月吊威亞的時候不小心受傷了，流了不少的血。”\n唐芷淇愣在了原地，下意識地用手按在胸口，臉色灰白……\n她早該想到了不是嗎？為什麼還抱著其他的希望？唐芷淇，你真傻。\n沈亦琛怎麼會無緣無故的回來？若不是宋明月又出事了，她怎麼可能會見到他沈亦琛的尊容？\n唐芷淇的突然停下了步伐，引起了沈亦琛的不滿，他回頭，皺著眉，嗬斥道：“你還愣著幹嘛？聽不懂嗎？”\n“我不去。”唐芷淇奮力地甩開沈亦琛的手，她完全能夠料想到沈亦琛接下來的動作，下一秒，她就被他重重地壓在了牆上。\n“你有什麼資格說不？”沈亦琛用力地捏著她的下巴，眼眸裏盡是火星。\n唐芷淇感覺下巴都快被他捏碎了，但此時身體上的疼卻絲毫抵不上心上的疼。\n她清楚地看到了沈亦琛眼底裏的憎恨。\n他的憎恨，是她唐芷淇無論如何都無法承受的，她隻感覺自己身處冰窖之中，渾身的血液都被冰凍住了，臉色沒有一絲血色。\n但她還是倔強的開口，“你放開我，我不去，三個月前你差點抽幹我的血，我好不容易活了過來，我不會再讓你們抽我的血了！”\n唐芷淇在心裏冷笑，兩年前宋明月作為她的替身演員在一場戲上出車禍顯些喪命的時候，沈亦琛為了救宋明月和她簽下了協議，從那時候開始她明白了他對宋明月的感情，也明白了他們之間的關係也隻有那份協議。\n這是她兩年來第一次直視沈亦琛的目光，第一次違背他的意願。\n“啪——”\n一個巴掌劃過上空，重重地落在唐芷淇的臉上，她一下子站不穩，摔到了地上，嘴角也因此流出了獻血。\n她還來不及做出反應，腰間突然一緊，天旋地轉，她被人扛在了肩上。\n“放開我！你放開我！我去，隻要你答應我一個條件，我就跟你去！”唐芷淇立刻嘶吼出來。\n既然逃不掉，那她就從沈亦琛身上討回點什麼。\n“嗬，跟我談條件？”沈亦琛一點也不想碰她，沒有一絲的憐香惜玉，他就直接將她摔到了沙發上。\n好在沙發比較柔軟，唐芷淇並沒有感覺有多痛，她剛想起來，就感覺脖子被一股巨大的力量，她艱難地抬起頭，對上了沈亦琛陰狠的目光。\n沈亦琛的態度她算是明白了，她還沒有提出條件，已經被他用行動拒絕了。\n她忍著胸口的刺痛，餘光看到了放在茶幾上的水果刀，她想也沒想，直接拿了過來，想要割自己的手腕。\n刀剛碰到肌膚，就被沈亦琛搶掉了，他厲聲對著唐芷淇怒吼：“你休想用死來逼我。”\n唐芷淇也忍無可忍地吼了出來，“到底是誰在逼誰？這是我的身體，我想怎麼樣就怎麼樣！”\n沈亦琛冷笑一聲，隨即，他戲虐地看向唐芷淇，“你可別忘了，協議裏可是寫得明明白白，無論何時何地，你都要用你的血救明月，你不去，我也會把你綁著去。”\n犀利的話語夾雜著嘲諷，一點點地刺痛唐芷淇的心臟，一點點地拆穿了她辛苦編織的最後的夢。",
      "chapterCount": 46,
      "chapterIndex": 1,
      "lastFreeChapterId": "33338382",
      "position": 1,
      "nextChapter": {
        "id": "33338370",
        "chapterName": "第二章：供血自願書",
        "isCharge": false,
        "position": 0
      },
      "bookInfo": {
        "author": "小妖本仙",
        "bookId": "11000162501",
        "bookName": "我曾愛你，奮不顧身",
        "introduction": "結婚兩年，素手調羹，最終也比不過他心中的那個白月光。\r\n她受夠了，也煩了單向婚姻，可是卻還是被他圈在他的世界裏。\r\n“如果你不愛我，就放開我好嗎！？”\r\n“放開你？這輩子都不可能！”",
        "cover": "https://nbookimg.klynf.com/cppartner/1x1/11x0/110x0/11000162501/11000162501.jpg?t=20210728144159",
        "bannerPic": "",
        "viewCountDisplay": "10.6萬",
        "lastChapterUtime": "2018-09-30 20:29:01",
        "ratings": "9.0",
        "chapterCount": "46",
        "writeStatus": "完本",
        "viewCount": "106068"
      }
    },
    "chapterContent": "\n唐芷淇站在落地窗前，臉色看起來有些煞白，嘴角自嘲地笑了出來。\n他大概是不會回來了吧……\n正想著，門外突然傳來了車子引擎的聲音，她立刻回過神來，跑到了門口翹首以待。\n門剛打開，沒等她反應過來，手就被一隻大掌抓住，人就被拽到了客廳。\n手上傳來的溫暖，男人寬厚的背影印在唐芷淇的眸子裏，貪婪的目光深深被迷住，她瞬間滿心歡喜，“亦琛，你回來啦？我做了很多你愛吃的……”\n“別廢話，跟我走。”沈亦琛不耐煩地打斷她，“明月吊威亞的時候不小心受傷了，流了不少的血。”\n唐芷淇愣在了原地，下意識地用手按在胸口，臉色灰白……\n她早該想到了不是嗎？為什麼還抱著其他的希望？唐芷淇，你真傻。\n沈亦琛怎麼會無緣無故的回來？若不是宋明月又出事了，她怎麼可能會見到他沈亦琛的尊容？\n唐芷淇的突然停下了步伐，引起了沈亦琛的不滿，他回頭，皺著眉，嗬斥道：“你還愣著幹嘛？聽不懂嗎？”\n“我不去。”唐芷淇奮力地甩開沈亦琛的手，她完全能夠料想到沈亦琛接下來的動作，下一秒，她就被他重重地壓在了牆上。\n“你有什麼資格說不？”沈亦琛用力地捏著她的下巴，眼眸裏盡是火星。\n唐芷淇感覺下巴都快被他捏碎了，但此時身體上的疼卻絲毫抵不上心上的疼。\n她清楚地看到了沈亦琛眼底裏的憎恨。\n他的憎恨，是她唐芷淇無論如何都無法承受的，她隻感覺自己身處冰窖之中，渾身的血液都被冰凍住了，臉色沒有一絲血色。\n但她還是倔強的開口，“你放開我，我不去，三個月前你差點抽幹我的血，我好不容易活了過來，我不會再讓你們抽我的血了！”\n唐芷淇在心裏冷笑，兩年前宋明月作為她的替身演員在一場戲上出車禍顯些喪命的時候，沈亦琛為了救宋明月和她簽下了協議，從那時候開始她明白了他對宋明月的感情，也明白了他們之間的關係也隻有那份協議。\n這是她兩年來第一次直視沈亦琛的目光，第一次違背他的意願。\n“啪——”\n一個巴掌劃過上空，重重地落在唐芷淇的臉上，她一下子站不穩，摔到了地上，嘴角也因此流出了獻血。\n她還來不及做出反應，腰間突然一緊，天旋地轉，她被人扛在了肩上。\n“放開我！你放開我！我去，隻要你答應我一個條件，我就跟你去！”唐芷淇立刻嘶吼出來。\n既然逃不掉，那她就從沈亦琛身上討回點什麼。\n“嗬，跟我談條件？”沈亦琛一點也不想碰她，沒有一絲的憐香惜玉，他就直接將她摔到了沙發上。\n好在沙發比較柔軟，唐芷淇並沒有感覺有多痛，她剛想起來，就感覺脖子被一股巨大的力量，她艱難地抬起頭，對上了沈亦琛陰狠的目光。\n沈亦琛的態度她算是明白了，她還沒有提出條件，已經被他用行動拒絕了。\n她忍著胸口的刺痛，餘光看到了放在茶幾上的水果刀，她想也沒想，直接拿了過來，想要割自己的手腕。\n刀剛碰到肌膚，就被沈亦琛搶掉了，他厲聲對著唐芷淇怒吼：“你休想用死來逼我。”\n唐芷淇也忍無可忍地吼了出來，“到底是誰在逼誰？這是我的身體，我想怎麼樣就怎麼樣！”\n沈亦琛冷笑一聲，隨即，他戲虐地看向唐芷淇，“你可別忘了，協議裏可是寫得明明白白，無論何時何地，你都要用你的血救明月，你不去，我也會把你綁著去。”\n犀利的話語夾雜著嘲諷，一點點地刺痛唐芷淇的心臟，一點點地拆穿了她辛苦編織的最後的夢。",
    "bookId": "11000162501",
    "isPc": true
  }

  // const { bookInfo } = await ownFetch('/detail.do', { bookId: '11000162501' });
  // const chapterInfo = await ownFetch('/chapterInfo.do', { bookId: '11000162501', chapterId: '33338367' })
  const contentList = chapterInfo.content.split('\n');

  const result: INetChapterDetailRes = {
    bookId: '11000162501',
    chapterId: '33338367',
    chapterStatus: 1,
    content: contentList,
    chapterName: 'xxxxz章节名称',
    chapterUtime: 'xxxxxxxxxx',
    coverWap: chapterInfo.bookInfo.cover,
    bookName: chapterInfo.bookInfo.bookName,
    status: EChapterStatus.免费,
    author: chapterInfo.bookInfo.author,
    // preChapterId?: string;
    // preChapterName?: string;
    nextChapterId: '33338370',
    nextChapterName: '第e章',
    chapterIndex: 2,
    sysTime: 'xxxxx'
  }

  res.status(200).json(result)
}
